; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-17)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(free left)
(at ball1 rooma)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room4)
(at ball10 room4)
(at ball11 room4)
(at ball12 room4)
(at ball13 room4)
(at ball14 room4)
(at ball15 room4)
(at ball16 room5)
(at ball17 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 roomb)
(at ball2 roomb)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 roomb)
(at ball15 roomb)
(at ball16 roomb)
(at ball17 roomb)
)
)
)

; plan
1. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 3 of 17
2. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 3 of 17
3. (drop ball1 roomb left)
   deleted: (carry ball1 left)
   added: (at ball1 roomb) (free left)
   goals met: 4 of 17
4. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 4 of 17
5. (pick ball17 room5 left)
   deleted: (at ball17 room5) (free left)
   added: (carry ball17 left)
   goals met: 4 of 17
6. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 4 of 17
7. (drop ball17 roomb left)
   deleted: (carry ball17 left)
   added: (at ball17 roomb) (free left)
   goals met: 5 of 17
8. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 5 of 17
9. (pick ball16 room5 left)
   deleted: (at ball16 room5) (free left)
   added: (carry ball16 left)
   goals met: 5 of 17
10. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 5 of 17
11. (drop ball16 roomb left)
   deleted: (carry ball16 left)
   added: (at ball16 roomb) (free left)
   goals met: 6 of 17
12. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 6 of 17
13. (pick ball9 room4 left)
   deleted: (at ball9 room4) (free left)
   added: (carry ball9 left)
   goals met: 6 of 17
14. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 6 of 17
15. (drop ball9 roomb left)
   deleted: (carry ball9 left)
   added: (at ball9 roomb) (free left)
   goals met: 7 of 17
16. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 7 of 17
17. (pick ball15 room4 left)
   deleted: (at ball15 room4) (free left)
   added: (carry ball15 left)
   goals met: 7 of 17
18. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 7 of 17
19. (drop ball15 roomb left)
   deleted: (carry ball15 left)
   added: (at ball15 roomb) (free left)
   goals met: 8 of 17
20. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 8 of 17
21. (pick ball14 room4 left)
   deleted: (at ball14 room4) (free left)
   added: (carry ball14 left)
   goals met: 8 of 17
22. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 8 of 17
23. (drop ball14 roomb left)
   deleted: (carry ball14 left)
   added: (at ball14 roomb) (free left)
   goals met: 9 of 17
24. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 9 of 17
25. (pick ball13 room4 left)
   deleted: (at ball13 room4) (free left)
   added: (carry ball13 left)
   goals met: 9 of 17
26. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 9 of 17
27. (drop ball13 roomb left)
   deleted: (carry ball13 left)
   added: (at ball13 roomb) (free left)
   goals met: 10 of 17
28. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 10 of 17
29. (pick ball12 room4 left)
   deleted: (at ball12 room4) (free left)
   added: (carry ball12 left)
   goals met: 10 of 17
30. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 10 of 17
31. (drop ball12 roomb left)
   deleted: (carry ball12 left)
   added: (at ball12 roomb) (free left)
   goals met: 11 of 17
32. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 11 of 17
33. (pick ball11 room4 left)
   deleted: (at ball11 room4) (free left)
   added: (carry ball11 left)
   goals met: 11 of 17
34. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 11 of 17
35. (drop ball11 roomb left)
   deleted: (carry ball11 left)
   added: (at ball11 roomb) (free left)
   goals met: 12 of 17
36. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 12 of 17
37. (pick ball10 room4 left)
   deleted: (at ball10 room4) (free left)
   added: (carry ball10 left)
   goals met: 12 of 17
38. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 12 of 17
39. (drop ball10 roomb left)
   deleted: (carry ball10 left)
   added: (at ball10 roomb) (free left)
   goals met: 13 of 17
40. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 13 of 17
41. (pick ball8 room3 left)
   deleted: (at ball8 room3) (free left)
   added: (carry ball8 left)
   goals met: 13 of 17
42. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 13 of 17
43. (drop ball8 roomb left)
   deleted: (carry ball8 left)
   added: (at ball8 roomb) (free left)
   goals met: 14 of 17
44. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 14 of 17
45. (pick ball7 room3 left)
   deleted: (at ball7 room3) (free left)
   added: (carry ball7 left)
   goals met: 14 of 17
46. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 14 of 17
47. (drop ball7 roomb left)
   deleted: (carry ball7 left)
   added: (at ball7 roomb) (free left)
   goals met: 15 of 17
48. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 15 of 17
49. (pick ball6 room3 left)
   deleted: (at ball6 room3) (free left)
   added: (carry ball6 left)
   goals met: 15 of 17
50. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 15 of 17
51. (drop ball6 roomb left)
   deleted: (carry ball6 left)
   added: (at ball6 roomb) (free left)
   goals met: 16 of 17
52. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 16 of 17
53. (pick ball5 room3 left)
   deleted: (at ball5 room3) (free left)
   added: (carry ball5 left)
   goals met: 16 of 17
54. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 16 of 17
55. (drop ball5 roomb left)
   deleted: (carry ball5 left)
   added: (at ball5 roomb) (free left)
   goals met: 17 of 17
